
categoriesData = [
    {
        "value": 3,
        "label": "איטלקי"
    },
    {
        "value": 2,
        "label": "בריא"
    },
    {
        "value": 5,
        "label": "בשרי"
    },
    {
        "value": 6,
        "label": "חלבי"
    },
    {
        "value": 1,
        "label": "כשר"
    },
    {
        "value": 9,
        "label": "מרקים"
    },
    {
        "value": 7,
        "label": "סלטים"
    },
    {
        "value": 4,
        "label": "צמחוני"
    },
    {
        "value": 8,
        "label": "קינוחים"
    }
]

measureUnitsData = [
    {
        "value": 2,
        "label": "גרם"
    },
    {
        "value": 13,
        "label": "חבילה"
    },
    {
        "value": 14,
        "label": "יחידה"
    },
    {
        "value": 12,
        "label": "יחידות"
    },
    {
        "value": 6,
        "label": "כוס"
    },
    {
        "value": 7,
        "label": "כוסות"
    },
    {
        "value": 4,
        "label": "כף"
    },
    {
        "value": 8,
        "label": "כפות"
    },
    {
        "value": 9,
        "label": "כפיות"
    },
    {
        "value": 5,
        "label": "כפית"
    },
    {
        "value": 11,
        "label": "ליטר"
    },
    {
        "value": 10,
        "label": "מיליליטר"
    },
    {
        "value": 1,
        "label": "קורט"
    },
    {
        "value": 3,
        "label": "קילו"
    }
]


ingredientsData = [
    {
        "value": 8,
        "label": "אבקת קקאו"
    },
    {
        "value": 9,
        "label": "אורז"
    },
    {
        "value": 26,
        "label": "אטריות אורז"
    },
    {
        "value": 40,
        "label": "אנטריקוט"
    },
    {
        "value": 5,
        "label": "ביצים"
    },
    {
        "value": 10,
        "label": "בננה"
    },
    {
        "value": 4,
        "label": "בצל"
    },
    {
        "value": 33,
        "label": "בשר טחון"
    },
    {
        "value": 27,
        "label": "גזר"
    },
    {
        "value": 28,
        "label": "גינגר"
    },
    {
        "value": 24,
        "label": "דבש"
    },
    {
        "value": 48,
        "label": "חלב"
    },
    {
        "value": 12,
        "label": "חרדל"
    },
    {
        "value": 31,
        "label": "כוסברה"
    },
    {
        "value": 29,
        "label": "כרוב"
    },
    {
        "value": 25,
        "label": "לימון"
    },
    {
        "value": 11,
        "label": "מים"
    },
    {
        "value": 1,
        "label": "מלח"
    },
    {
        "value": 38,
        "label": "מלפפון"
    },
    {
        "value": 6,
        "label": "סוכר"
    },
    {
        "value": 42,
        "label": "סילאן"
    },
    {
        "value": 21,
        "label": "סלמון"
    },
    {
        "value": 39,
        "label": "סלרי"
    },
    {
        "value": 32,
        "label": "פטרוזיליה"
    },
    {
        "value": 30,
        "label": "פיתות"
    },
    {
        "value": 2,
        "label": "פלפל"
    },
    {
        "value": 43,
        "label": "פפריקה מתוקה"
    },
    {
        "value": 35,
        "label": "פרגיות"
    },
    {
        "value": 34,
        "label": "צנוברים"
    },
    {
        "value": 36,
        "label": "קוסקוס"
    },
    {
        "value": 7,
        "label": "קמח"
    },
    {
        "value": 16,
        "label": "קפה נמס"
    },
    {
        "value": 46,
        "label": "רוזמרין"
    },
    {
        "value": 22,
        "label": "רוטב טריאקי"
    },
    {
        "value": 20,
        "label": "רוטב סויה"
    },
    {
        "value": 41,
        "label": "רוסטביף"
    },
    {
        "value": 47,
        "label": "ריבת חלב"
    },
    {
        "value": 23,
        "label": "שומשום"
    },
    {
        "value": 19,
        "label": "שוקולד מריר"
    },
    {
        "value": 13,
        "label": "שוקולית"
    },
    {
        "value": 44,
        "label": "שזיפים"
    },
    {
        "value": 3,
        "label": "שיני שום"
    },
    {
        "value": 15,
        "label": "שמן זית"
    },
    {
        "value": 14,
        "label": "שמן קנולה"
    },
    {
        "value": 17,
        "label": "שמנת מתוקה"
    },
    {
        "value": 37,
        "label": "שעועית ירוק"
    },
    {
        "value": 45,
        "label": "תימין"
    },
    {
        "value": 18,
        "label": "תמצית וניל"
    }
]


recipesData = [
    {
        "id": 27,
        "userId": 1,
        "title": "ארטיק ריבת חלב בציפוי קריספי עם הפתעה בפנים!",
        "description": "שדגשדגשדג",
        "views": 3,
        "createdAt": "2021-07-21T06:46:22.000Z",
        "mainImageUrl": "74a65c0c-d118-436d-94b8-02d8ad322bb9.jpeg"
    },
    {
        "id": 26,
        "userId": 3,
        "title": "טעים על מלא: שיפודי פרגית לצד סלט קוסקוס מלא",
        "description": "אמיר דן ויונית צוקרמן מכינים ארוחה מזינה לטיול משפחתי בחוץ - שיפודי פרגית במרינדה לימונית עם רימונים ולימון כבוש, בתוספת סלט קוסקוס מלא עשיר בירקות ירוקים\n",
        "views": 12,
        "createdAt": "2021-07-19T13:34:37.000Z",
        "mainImageUrl": "cf14eb67-edf0-41ce-95d8-1344652ba876.png"
    },
    {
        "id": 25,
        "userId": 1,
        "title": "מאפה פסטה צינורות ברוטב רוזה עם טוויסט מגניב!",
        "description": "מאפה פסטה צינורות ברוטב רוזה שסוגר לכם את הפינה לכל המשפחה, עם טריק קטן שעושה את כל ההבדל! את הצינורות מעמידים בתבנית וממלאים ברוטב הטעים",
        "views": 7,
        "createdAt": "2021-07-18T13:50:19.000Z",
        "mainImageUrl": "020858a7-d139-468e-8018-ab95389a8f2c.jpeg"
    },
    {
        "id": 24,
        "userId": 1,
        "title": "כנאפה כמו בירושלים שמכינים ב-10 דקות עבודה",
        "description": "אז אם גם לכם בא פתאום כנאפה בטירוף, קבלו מתכון פשוט ומהיר לגרסה ביתית אבל לא מאכזבת בכלל לכנאפה מתוקה וחמה שמכינים בעשר דקות ומתמכרים אליה בדקה\n",
        "views": 5,
        "createdAt": "2021-07-18T10:03:29.000Z",
        "mainImageUrl": "d556719d-ce2a-41f4-98c0-36411396dff4.jpeg"
    },
    {
        "id": 23,
        "userId": 1,
        "title": "העראייס של אהרוני – פיתה צלויה במילוי בשר טחון וצנוברים",
        "description": "פיתות צלויות במילוי בשר עסיסי עם צנוברים ועשבי תיבול שמכינים במהירות – אהרוני מלמד אתכם איך להכין עראייס, המנה שתשדרג כל מנגל\n",
        "views": 8,
        "createdAt": "2021-07-18T08:37:53.000Z",
        "mainImageUrl": "e4b5aa67-9824-40c7-b9f7-10b7ce9ec059.png"
    },
    {
        "id": 22,
        "userId": 1,
        "title": "קליק מביס ראשון: עוגת ביסקוויטים שהיא משחק ילדים",
        "description": "ראו הוזהרתם! המתכון הבא מכיל שכבות של אושר שלא תרצו להפסיק לאכול, עוגת ביסקוויטים שכבות מתוקות של גבינה עם קליק כריות וקליק כדורים - אל תגידו שלא אמרנו\n",
        "views": 8,
        "createdAt": "2021-07-17T21:01:57.000Z",
        "mainImageUrl": "d578d186-0965-4864-81b4-9359440a7567.jpeg"
    },
    {
        "id": 21,
        "userId": 1,
        "title": "מגדל אלפחורס, שוקולד ומסקרפונה של תומר אומנסקי",
        "description": "זה לא מתכון לעוגה זה מתכון למגדל אלפחורס, שוקולד ומסקרפונה! תומר אומנסקי מפציץ עם מתכון לעוגה שיש בה הכל - הכי מטורפת וטעימה שתכינו זה בטוח!\n",
        "views": 6,
        "createdAt": "2021-07-17T19:23:05.000Z",
        "mainImageUrl": "d12662a4-73d3-4aa0-8bf0-8adf9032ae93.jpeg"
    },
    {
        "id": 19,
        "userId": 1,
        "title": "פאד תאי צמחוני שמכינים בצ’יק צ’אק וכולם אוהבים לזלול!",
        "description": "פאד תאי צמחוני בסגנון סיני - עם אטריות אורז ורוטב אסייתי מושלם, שמכינים במהירות במחבת או בווק. מתכון קל להכנה, טעים ומנצח שכולם אוהבים\n",
        "views": 14,
        "createdAt": "2021-07-17T12:03:37.000Z",
        "mainImageUrl": "8d779e41-7448-4ba2-99a9-0d711999ed14.jpeg"
    },
    {
        "id": 18,
        "userId": 1,
        "title": "זאת מנה ליום שישי! רוסטביף אנטריקוט צלוי בגריל עם בטטות",
        "description": "אמיר דן מכין רוסטביף עסיסי מנתח אנטריקוט שלם, צלוי בתנור ומתובל בתימין, רוזמרין, שום, סילאן ואיולי חזרת. את הרוסטביף מגישים פרוס לצד בטטות צלויות מתקתקות\n",
        "views": 6,
        "createdAt": "2021-07-17T12:02:25.000Z",
        "mainImageUrl": "481df93f-ed2c-4c38-b28d-81bad4709552.png"
    },
    {
        "id": 17,
        "userId": 1,
        "title": "תבשיל בקר בשזיפים",
        "description": "השנה פנקו את האורחים עם תבשיל בקר עסיסי ברוטב שזיפים. תבשיל עשיר בתבלינים מחממים שכדאי להגיש עם פירה או אורז כמנה נהדרת לחג או לכל יום חול\n",
        "views": 3,
        "createdAt": "2021-07-17T12:02:02.000Z",
        "mainImageUrl": "68b497c4-88ef-48ca-9287-615d69ae84d9.jpeg"
    },
    {
        "id": 16,
        "userId": 1,
        "title": "פיצה-לזניה: מאפה מעלי לזניה עם רוטב עגבניות של אושר אידלמן",
        "description": "אושר אידלמן שילב בין שתי קלאסיקות שכולנו אוהבים, פיצה ולזניה, וקיבל פיצה-לזניה מושלמת. מכינים עם הילדים ונהנים מארוחה משפחתית\n",
        "views": 1,
        "createdAt": "2021-07-17T12:01:39.000Z",
        "mainImageUrl": "6d49dc2a-bf1a-4f8e-9d35-939defafd768.png"
    },
    {
        "id": 15,
        "userId": 1,
        "title": "פנקייק מהיר מ-4 מרכיבים",
        "description": "ההכנה הכי מהירה שיש לפנקייק קוואקר טעים בטירוף! איך מכינים פנקייק צמחוני, בריא ומפנק? בקלי קלות וממצרכים שיש לכל אחד בבית\n",
        "views": 6,
        "createdAt": "2021-07-17T11:59:11.000Z",
        "mainImageUrl": "b0ccba23-d0a2-405b-bba0-88072a3e3920.jpeg"
    }
]
